/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "gp_section_570558080551486279": {
      "settings": {
        "checksum": "e7e8d11c729183d741c6e0649d953cbc56650b0fb926f2642d331b6428b73f9f_1_1_1_0__1",
        "gg-1Am1SKHT_text": "<p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">Within a few weeks, something shifted. Not just in my posture and strength—though I could see those changes too—but in my entire mood. <strong>I had more energy and patience for my kids after I worked out.</strong> Instead of ending each day completely depleted, <strong>I felt like I actually had something left to give.</strong></span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">The physical changes were undeniable. I absolutely loved how I felt and looked, standing <strong>stronger and more confident</strong>. But the emotional shift was even more profound. For the first time in years, <strong>I felt like I was doing something just for me.</strong></span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">One evening, as I was heading to my reformer, my six-year-old looked up from his coloring and said, \"Go exercise, Mom, so you can have a <strong>happy day tomorrow too</strong>!\" No more guilt. No more feeling selfish. Having a fit mom meant they realized I had needs too, and somehow that made me a much better, happier, healthier mom.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\"><strong>I had given myself permission to matter. And somehow, that made me better at everything else.</strong></span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">I'd catch myself in the mirror after a session—face flushed, standing taller, actually smiling—and think, There she is. <strong>There's the woman I thought I'd lost.</strong></span></p>",
        "gg-JNxvY5fp_text": "<p>|</p>",
        "gg-Mdwlf8_K_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:11pt;\"><i>June 10, 2025 | By Jennifer Hayes | Working Mom of Two, Pilates Convert | 3-minute read</i></span></p>",
        "gg2sQ1heyfT_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:22px;\"><i>How one mom's desperate search for balance led to the most transformative decision of her life</i></span></p>",
        "gg7LfOo4RFX_text": "<p>Best Choice</p>",
        "gg8OoyVThmo_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">The doubt was crushing. Would I actually use it enough to justify the cost? I felt like I'd be so guilty spending that much money unless I knew I'd use it every single day. We were saving for a family vacation—how could I justify spending that money on myself?</span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">But then I sat down and did the math. <strong>Studio classes were $65 each, plus gas, plus babysitting </strong>when my husband couldn't watch the kids. <strong>This would actually save us money in the long run.</strong></span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">And when I mentioned it to my kids? Their reaction surprised me: \"Mom, go exercise so you can have a happy day!\"</span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">That's when it finally clicked—<strong>self-care wasn't selfish.</strong> <strong>It was necessary</strong> for my family and myself. My family deserved the best version of me, and that required me actually taking care of myself too.</span></p>",
        "ggDCTNtp4Dy_text": "<p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">Every night, the same guilty thoughts circled: <strong>I never have time for myself because I'm always last on my own list</strong>. I'd catch my reflection in the bathroom mirror—tired, stressed, barely recognizable—and feel this deep pang of sadness for the woman I used to be.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">Even thinking about <strong>spending money on myself would trigger immediate guilt</strong>, even when I knew it was something important. The thought of taking time for exercise felt selfish when my kids needed me, when work was demanding, when the house was falling apart. I hated how guilty I felt every single time I even considered prioritizing myself.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">But then I'd snap at my kids because I was exhausted, and this other voice would whisper: <strong>If I don't take care of myself, how can I care for others?</strong></span></p>",
        "ggH2Fg0tfL-_text": "<p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">So I did it!—<strong>I ordered the Elevé Reformer.</strong> The day it arrived, my heart actually fluttered as I opened the box. <strong>This wasn't some cheap knockoff or another folding contraption</strong> that would wobble under pressure. It was gorgeous, solid wood, beautifully crafted—something that belonged in my home rather than hiding shamefully in a basement.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">Even though I hadn't been to a Pilates class in over two years, the <strong>guided routines</strong> made everything easy. I didn't have to think or worry about doing something wrong—I just followed along and felt my body waking up.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">That first session, I lit a candle, put on a soft playlist, and moved in total silence while the kids napped. <strong>For those 20 minutes, I wasn't a mom, or a wife, or an employee. I was just... me.</strong> Day by day, during those precious nap times, I began to feel muscles wake up that I'd forgotten I had.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">The movements were exactly what I <strong>remembered from studio classes</strong>—gentle but deep, challenging but doable. It felt like having my favorite Pilates class right <strong>in my living room</strong>, but better—because I could pause if someone needed me, restart when <strong>I was ready</strong>, and never worry about rushing home.</span></p>",
        "ggLYZ_fTVBs_text": "<p><span style=\"font-size:19px;\">Only 50 Elevé Reformers are crafted each month. If this page is live, one might still be available.</span></p>",
        "ggNuUbPUH4C_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:21px;\"><strong>I loved Pilates, but trying to get back to studio classes just added more stress </strong>to my life. Between traffic, parking, finding childcare, and those rigid schedules that never matched my unpredictable mom reality, I'd arrive more frazzled than when I left home.</span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">I<strong>'d bought equipment before that ended up gathering dust</strong> in the basement—resistance bands, workout DVDs, even a fancy exercise bike that became the world's most expensive clothes hanger. I was terrified of wasting money again on another piece of equipment that would mock me from the corner.</span></p><p><br>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">Navigating life as a stay-at-home mom who also worked was impossibly hard. Every solution seemed designed for women who didn't have my reality—the constant interruptions, the guilt, the sheer exhaustion of keeping everyone else's life together while mine fell apart</span></p>",
        "ggOPOAw6hpj_text": "<p><span style=\"font-size:16px;\">SALE ENDS SOON</span></p>",
        "ggQXaKrWLOg_text": "<span style=\"font-size:32px;\">The Day I Stopped Feeling Guilty&nbsp;About 20 Minutes of \"Me Time\"</span>",
        "ggSt7dUzyzZ_label": "<p>CHECK AVAILABILITY</p>",
        "ggSzcYWICSo_text": "<p><span style=\"color:#242424;\">Trusted by 10,000+ Moms</span></p>",
        "ggT-zTB93Mi_text": "<p><span style=\"background-color:transparent;color:#242424;font-size:21px;\"><strong>The alarm goes off at 5:30 AM, and I'm already behind</strong>. Coffee, lunches, backpacks, work clothes—the morning tornado hits before I'm even awake. By 8 PM, after dishes and bedtime stories, I collapse on the couch and realize the majority of <strong>my day was spent cooking, cleaning, doing laundry</strong>, running errands.</span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">This was my reality every single day. I'd sit there and wish desperately that it was more balanced—but wishing wasn't changing anything.</span></p>",
        "ggWEjr_MR6n_text": "<span style=\"font-size:31px;\">The Transformation Nobody Expected</span>",
        "ggZqALtI8lT_text": "<p>Sell-out Risk: <span style=\"color:#E30D0D;\"><strong>High</strong></span></p>",
        "gg_76GaKrYV_text": "<span style=\"background-color:transparent;color:#000000;font-size:31px;\"><strong>Every Solution That Failed Me</strong></span>",
        "gg_TvAdqv9d_text": "<span style=\"font-size:31px;\">The Internal Battle I Had to Win</span>",
        "ggbzw4dDG5d_text": "<span style=\"font-size:32px;\">The Voice in My Head That Never Stopped</span>",
        "ggfMLOslev1_text": "<span style=\"font-size:31px;\">The Discovery That Changed Everything</span>",
        "ggfn3U23ZCX_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>When Exhaustion Became My Normal</strong></span>",
        "ggiHdU6pNbx_text": "<p><span style=\"background-color:transparent;color:#242424;font-size:21px;\">One sleepless night, I was scrolling on my phone while the baby was restless, and I stumbled across something that made me stop mid-scroll. <strong>A mom, writing about her home reformer with such genuine joy</strong>: she was in love with her new reformer and could do a reformer workout whenever she wanted.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\"><strong>At home? A real reformer? </strong>The idea lit a spark in me I hadn't felt in months.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">I started researching obsessively. Women were writing about hopping on for 20 minutes whenever the baby napped. No more traveling to classes or waiting on waitlists. Having a reformer at home made them feel like they finally had control over their wellness again.</span></p><p>&nbsp;</p><p><br><span style=\"background-color:transparent;color:#242424;font-size:21px;\">These weren't fitness influencers with perfect lives—these were moms like me, finding a way back to themselves.</span></p>",
        "ggjs2QHMhgb_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">I wasn't always like this. <strong>Before kids, I was the woman who had Pilates classes scheduled twice a week.</strong> I remember walking out of those sessions feeling powerful, centered, like I could handle anything life threw at me.</span></p><p>&nbsp;</p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:21px;\">Those reformer sessions made me feel like I was discovering parts of myself I'd forgotten existed. <strong>I wanted desperately to feel strong and proud when I looked in the mirror again</strong>. I missed that version of me—the woman who stood tall, who felt graceful in her own skin, who had this quiet confidence that came from truly taking care of herself.</span></p>",
        "ggkIiSGeaRX_text": "Enjoy $750 off, on me!",
        "ggmjpMlmH7T_text": "<span style=\"font-size:31px;\">Elevé Reformer</span>",
        "ggnvf5ZWOHa_text": "<span style=\"font-size:31px;\">Bringing My Studio Home</span>",
        "ggo6-hw-siL_text": "<p><span style=\"font-size:16px;\">Try it today with a 30-Day Money Back Guarantee!</span></p>",
        "ggobmRH9OIq_text": "<span style=\"font-size:31px;\"><strong>The Woman I Used to Be</strong></span>",
        "ggpFmuwvA7v_text": "<p><strong>FREE </strong>shipping</p>",
        "section_preload": "true"
      },
      "type": "gp-section-570558080551486279"
    },
    "gp_section_570558080551551815": {
      "settings": {
        "checksum": "3c0ecaf3495b7a8f32c1d12de55c992e6a067129f68e3f76319058501bc387a3_1_1_1_0__1",
        "gg2U0rhOw13_text": "<p>\"It’s like a sanctuary in the middle of my living room.\"</p>",
        "gg4ccAsDJmj_text": "<p>- Amara B.</p>",
        "ggEyHa-UPkT_text": "<p>\"It’s not loud. It’s not bulky. It doesn’t demand anything from me. I step on, I move with intention, and I feel better. This reformer brought back a version of me I didn’t know I was allowed to reclaim.\"</p>",
        "ggFjb4YraFN_text": "<p>- Jenna R.</p>",
        "ggL1_5n0f6J_text": "<p>- Melissa J.</p>",
        "ggRY0-ySu2I_text": "<p>- Rachelle S.</p>",
        "ggVFyU1ycAv_text": "<p>\"The only thing that’s stuck in my routine since having kids.\"</p>",
        "gggbr5-O9e6_text": "What Other Moms Are Saying",
        "ggiOigIfOAM_text": "<p>\"She said, ‘Mommy, can I do that with you?’ It’s not just about fitness. It’s about showing up for myself in front of my kids. I finally feel like I’m setting the example I’ve always wanted to.</p>",
        "ggkKVuN56aC_text": "<p>\"My daughter joined me on the reformer. I cried.\"</p>",
        "ggkM2FpAeqX_text": "<p>\"I’ve bought apps, mats, subscriptions, you name it. Nothing ever lasted more than a week. But the Elevé? I’ve used it almost every day for two months. It feels like therapy for my body, and it’s the only thing I look forward to after the chaos of mornings.\"</p>",
        "ggsv1K7a-mo_text": "<p>\"Worth every penny... and then some\"</p>",
        "ggvFVWKzP1G_text": "<p>\"I hesitated at first because it’s an investment. But I realized I was spending more on studio memberships I couldn’t use and impulse buys trying to ‘feel better.’ This actually works. It’s beautiful, it’s calming, and I feel stronger and more in control again.\"</p>"
      },
      "type": "gp-section-570558080551551815"
    },
    "gp_section_570558080551617351": {
      "settings": {
        "checksum": "005acba40fffe004ce74e0a3b3cc407d89c82650b1cde56615535bf91fbfe246_1_1_1_0__1",
        "ggTeyYhZECO_label": "<p>CHECK AVAILABILITY</p>"
      },
      "type": "gp-section-570558080551617351"
    }
  },
  "order": [
    "gp_section_570558080551486279",
    "gp_section_570558080551551815",
    "gp_section_570558080551617351"
  ],
  "layout": "theme.gempages.blank"
}
