/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "gp_section_571080519534511328": {
      "settings": {
        "checksum": "3883bc1890d3e9b15adee3693ef169e165209dfcff18813e4679e613c9ff1c9c_1_1_1_0__1",
        "gg-JNxvY5fp_text": "<p>|</p>",
        "gg-Mdwlf8_K_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i><strong>By Sarah Mitchell, mother of 2 | Published June 15, 2024 | 2 min read</strong></i></span></p>",
        "gg1-IXwa58P_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">If you've made it this far, I have a feeling you see yourself in my story. Maybe you're the mom who dropped her child because her body failed her. Maybe you're the one who moves through life afraid of your own spine. Maybe you know the weight of feeling broken while everyone around you needs you to be strong.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I want you to know: <strong>you're not broken. You're rebuilding.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>Six months ago, I was the mom who couldn't pick up her crying daughter.</strong> <strong>Today, Emma and I have tickle fights</strong> that last until we're both breathless with laughter. We dance to silly songs while making breakfast. I carry her to bed every single night—not because I have to, but because I can.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>The only difference? I stopped accepting that \"this is just how life is now\" and chose to believe I deserved better.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Maybe your pain is that constant ache that never quite goes away. Maybe it's those sharp spikes that make you gasp and grab the nearest wall. Either way, you know the weight of moving through life afraid of your own body.</span></p><p><br><span style=\"background-color:transparent;color:#000000;font-size:18px;\">If you've been waiting for permission to put yourself first, to invest in your wellbeing, to believe that you deserve to feel strong and capable again—consider this your sign.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>You have a choice right in front of you.</strong></span></p>",
        "gg19WHgsgRi_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>It was 6:47 AM when my world crumbled.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">The house was still wrapped in that quiet morning stillness—only the gentle hum of the coffee maker and the distant chirping of birds outside our bedroom window. Then came the sound of Emma's bare feet padding across the cold hardwood, each step deliberate and careful the way only a scared three-year-old moves.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>Her pajama top was twisted, blonde hair matted against one cheek, and tears caught the dim light filtering through our curtains.</strong> Another nightmare. The monsters were back, and she just wanted her mommy to make them disappear.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I reached down without thinking, my arms opening in that automatic gesture of motherhood I'd performed countless times. But this time, <strong>that familiar lightning bolt didn't just shoot through my spine—it exploded like a live wire,</strong> stealing my breath and buckling my knees. The pain was so sudden, so overwhelming, that I gasped and stumbled backward against the cool bedroom wall.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">My arms fell uselessly to my sides. Emma stood there in her rumpled unicorn pajamas, reaching up with those small, trusting hands while I pressed my palms against the wall behind me, tears streaming down my face.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>\"Mommy?\" she whispered, her voice cracking. \"Why won't you pick me up?\"</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>I couldn't even touch my own daughter.</strong></span></p>",
        "gg2sQ1heyfT_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:21px;\"><i><strong>From breakdown to breakthrough—how I joined thousands of moms curing their pain without leaving the house</strong></i></span></p>",
        "gg7LfOo4RFX_text": "<p>Best Choice</p>",
        "gg8OoyVThmo_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I won't pretend the Elevé Reformer isn't a significant investment. At $1,999, it required a real conversation with my husband about our priorities and values. But <strong>when I calculated</strong> what I'd been spending on treatments that only provided temporary relief—<strong>$150 physical therapy sessions</strong> three times a week, <strong>$80 chiropractor visits twice weekly</strong>, <strong>$120 massage sessions</strong>—I realized <strong>I'd already</strong> <strong>spent over $18,000 in two years with nothing lasting to show for it.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>The Elevé pays for itself in under four months</strong> and then provides years of consistent, gentle care. But honestly, the money became irrelevant the moment<strong> I realized what I'd really bought: the ability to hug my daughter without calculating the cost to my spine.</strong></span></p>",
        "ggDCTNtp4Dy_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Three months after that awful morning with Emma, <strong>I found myself awake at 2 AM</strong>, my back throbbing as I scrolled through my phone while my family slept peacefully around me. Sleep felt impossible when every position brought its own particular flavor of discomfort.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">That's when I stumbled across a story that stopped me cold—written by another mom whose words felt like they'd been pulled straight from my own heart.<strong> She described the grief of losing yourself to chronic pain,</strong> the quiet desperation of feeling betrayed by your own body, the exhaustion of being the family's caregiver when you could barely care for yourself.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">But then she shared something that made me sit up in bed despite the sharp protest from my spine:<strong> how she'd found her way back to herself through something called the Elevé Reformer.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I'd heard of reformer Pilates before—those elegant wooden machines in expensive studios that seemed designed for people who already had their lives together. But as I read deeper into the night, I learned this was different. <strong>This was created specifically for women like us,</strong> for <strong>moms who needed something gentle yet effective</strong>, something that honored our bodies instead of punishing them.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>As dawn crept through our bedroom windows, something stirred in me that I hadn't felt in years: the dangerous flutter of hope.</strong></span></p>",
        "ggHEC3VHcq__text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>A Letter to the Mom Reading This</strong></span>",
        "ggHVFFc6c8b_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>The Investment That Changed Everything</strong></span>",
        "ggK4YqD3uA5_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>What I Learned About Gentle Strength</strong></span>",
        "ggLYZ_fTVBs_text": "<p><span style=\"font-size:19px;\">Only 50 Elevé Reformers are crafted each month. If this page is live, one might still be available.</span></p>",
        "ggNuUbPUH4C_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>The day my Elevé Reformer arrived, I ran my hands along the smooth beech wood frame</strong>—imported from Germany.<strong> It wasn’t just beautiful—it was&nbsp;</strong><i><strong>intentional</strong></i><strong>. </strong>The craftsmanship was exquisite, substantial but somehow feminine, like a piece of furniture that belonged in my life rather than dominating it.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Those first sessions were nothing like the punishing workouts I'd forced myself through before. <strong>The movements were fluid, controlled, almost meditative. </strong>The machine's whisper-quiet operation meant I could use it during naptime without disturbing anyone. But more than that, I</span><span style=\"font-size:18px;\"><strong>t felt safe—like a place where I could reconnect with my body without fear</strong></span><span style=\"background-color:transparent;color:#000000;font-size:18px;\"> of making things worse.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>By the end of my first week</strong>, something remarkable happened:<strong> I slept through the night for the first time in five years.</strong> Not because the pain had vanished completely, but because my body felt... settled. Like it remembered how to rest.</span></p>",
        "ggOPOAw6hpj_text": "<p><span style=\"font-size:16px;\">SALE ENDS SOON</span></p>",
        "ggQXaKrWLOg_text": "<span style=\"background-color:transparent;color:#000000;font-size:23pt;\"><strong>“Mommy, Why Won’t You Hold Me?”: The Painful Moment That Led Me to a Life Without Back Pain—All From Home</strong></span>",
        "ggSt7dUzyzZ_label": "<p>CHECK AVAILABILITY</p>",
        "ggSzcYWICSo_text": "<p><span style=\"color:#242424;\">Trusted by 10,000+ Moms</span></p>",
        "ggT-zTB93Mi_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">That morning shattered something deep inside me—not just physically, but in a way that reached into every corner of who I thought I was as a mother. <strong>For 27 years, I'd carried this pain like a shadow I couldn't escape.</strong> Some mornings it whispered; other days, like that Tuesday, it screamed so loud it drowned out everything else.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I used to be the mom who could scoop up both kids at once, who spun them around the kitchen while pasta boiled, who felt strong and alive in her own body. Somewhere between pregnancies and sleepless nights and the relentless demands of motherhood, that woman had vanished, replaced by someone who moved like she was made of glass.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">The worst part wasn't even the constant ache—it was watching my life shrink around it. <strong>Declining playdate</strong>s because I couldn't keep up at the park. <strong>Sitting on the sidelines</strong> during family photos because standing too long made me wince. <strong>Saying \"Mommy can't\" more often than \"Let's go.\"</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">I'd tried everything, or so I thought. Physical therapy sessions that cost more than our mortgage payment and left me feeling like a broken toy being wound tighter. Chiropractor visits twice a week that provided maybe two hours of relief before the familiar tension crept back. Massage appointments that felt indulgent and temporary, like putting a band-aid on a broken dam.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>Every failed treatment added another layer of defeat.</strong> <strong>I started to believe this was just my life now</strong>—that some people get to feel strong in their bodies, and I wasn't one of them.</span></p>",
        "ggZqALtI8lT_text": "<p>Sell-out Risk: <span style=\"color:#E30D0D;\"><strong>High</strong></span></p>",
        "gg_76GaKrYV_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>Coming Home to Myself</strong></span>",
        "ggbzw4dDG5d_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>The Night Everything Shifted</strong></span>",
        "ggfMLOslev1_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>The Quiet Wins That Changed Everything</strong></span>",
        "ggfn3U23ZCX_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>The Weight of Always Being Last</strong></span>",
        "ggiHdU6pNbx_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">The transformation didn't announce itself with fireworks. Instead, it crept into my life through small, precious moments:</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>Day 10: I bent down to tie my shoes without that familiar stab of dread.</i></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>Day 18: I carried all the groceries in one trip—not because I had to, but because I could.</i></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>Day 25: Emma asked me to dance with her, and instead of making excuses, I spun her around the kitchen until we were both dizzy with laughter.</i></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>Week 5: I realized I'd stopped calculating every movement, stopped bracing for pain before I moved.</i></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>Week 8: I slept on my side for the first time in three years.</i></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Each small victory built on the last, <strong>creating a foundation of trust between my body and me that I thought was lost forever</strong>. The constant 4-out-of-10 ache that had been my soundtrack for years began to fade into memory.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">By week twelve, I wasn't just moving differently—I was&nbsp;<i>being</i> differently. Standing taller. Speaking up more. Taking up space like I had<strong> permission to exist fully in my own life again.</strong></span></p>",
        "ggjs2QHMhgb_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">For weeks, I bookmarked that article and returned to it like a secret. Part of me wanted to believe so badly that a solution existed, but another part—the part that had been disappointed too many times—whispered its familiar warnings.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i><strong>What if this was just another expensive machine </strong>that would end up buried under laundry and guilt?</i> I'd been down this road before. The treadmill that became a clothes hanger. The resistance bands gathering dust in my closet. The yoga DVDs I'd watched exactly twice.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i><strong>What if I wasn't disciplined enough?</strong></i> What if I started strong for two weeks and then life happened—sick kids, work deadlines, the endless cycle of daily survival—and I gave up like I always did?</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i><strong>What if I was broken beyond repair?</strong></i> Maybe some backs were just meant to hurt. Maybe I was asking for too much, wanting too much, hoping for too much.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>But then I thought about Emma that morning,</strong> reaching for a mother who couldn't reach back. I thought about all the moments I was missing, all the life I was sitting out because my body felt like a prison instead of a home.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>Maybe it was time to bet on myself, just once more.</strong></span></p>",
        "ggkIiSGeaRX_text": "Enjoy $750 off, on me!",
        "ggmjpMlmH7T_text": "<span style=\"font-size:31px;\">Elevé Reformer</span>",
        "ggo6-hw-siL_text": "<p><span style=\"font-size:16px;\">Try it today with a 30-Day Money Back Guarantee!</span></p>",
        "ggobmRH9OIq_text": "<span style=\"background-color:transparent;color:#000000;font-size:32px;\"><strong>Why I Almost Didn't Try</strong></span>",
        "ggpFmuwvA7v_text": "<p><strong>FREE </strong>shipping</p>",
        "ggys100qsA8_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">The Elevé Reformer taught me something I'd forgotten: <strong>strength doesn't have to hurt</strong>. Those 20-30 minutes I spent on my reformer each morning weren't time stolen from my family—they were an investment in being the mother, wife, and woman I wanted to be.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>The precision resistance helped \"unfreeze\" something in my nervous system</strong> that had been locked down for years. But more than physical relief, it gave me back my sense of agency. For the first time in a long time,<strong> I was doing something proactive for my body instead of just managing its limitations.</strong></span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Other moms have shared their own quiet victories:</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>\"After 15 years of chronic pain, I thought I was broken forever. <strong>Three months with my Elevé, and I feel 20 years younger.</strong> I literally forgot what it felt like to wake up without pain.\"</i> —Maria K.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>\"I was sleeping in a recliner because our bed hurt too much. Now I work out every morning pain-free. <strong>My kids say I'm like a different person</strong>—I am a different person.\"</i> —Jennifer L.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><i>\"The first time I slept 8 hours straight, I woke up and cried happy tears. This machine didn't just give me my life back—it gave me a life I'd never had.\"</i> —Lisa M.</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Over 10,000 women have discovered what I found in my living room: that <strong>healing doesn't have to be complicated, expensive, or time-consuming</strong>. It just has to be consistent and kind.</span></p>",
        "section_preload": "true"
      },
      "type": "gp-section-571080519534511328"
    },
    "gp_section_571080519534576864": {
      "settings": {
        "checksum": "2c2be35be16f3a4c6fcc1417a4856e6c5fdcc170600fbb28f85c41f2ec67c4ce_1_1_1_0__1",
        "gg2U0rhOw13_text": "<p>\"It’s like a sanctuary in the middle of my living room.\"</p>",
        "gg4ccAsDJmj_text": "<p>- Amara B.</p>",
        "ggEyHa-UPkT_text": "<p>\"It’s not loud. It’s not bulky. It doesn’t demand anything from me. I step on, I move with intention, and I feel better. This reformer brought back a version of me I didn’t know I was allowed to reclaim.\"</p>",
        "ggFjb4YraFN_text": "<p>- Jenna R.</p>",
        "ggL1_5n0f6J_text": "<p>- Melissa J.</p>",
        "ggRY0-ySu2I_text": "<p>- Rachelle S.</p>",
        "ggVFyU1ycAv_text": "<p>\"The only thing that’s stuck in my routine since having kids.\"</p>",
        "gggbr5-O9e6_text": "What Other Moms Are Saying",
        "ggiOigIfOAM_text": "<p>\"She said, ‘Mommy, can I do that with you?’ It’s not just about fitness. It’s about showing up for myself in front of my kids. I finally feel like I’m setting the example I’ve always wanted to.</p>",
        "ggkKVuN56aC_text": "<p>\"My daughter joined me on the reformer. I cried.\"</p>",
        "ggkM2FpAeqX_text": "<p>\"I’ve bought apps, mats, subscriptions, you name it. Nothing ever lasted more than a week. But the Elevé? I’ve used it almost every day for two months. It feels like therapy for my body, and it’s the only thing I look forward to after the chaos of mornings.\"</p>",
        "ggsv1K7a-mo_text": "<p>\"Worth every penny... and then some\"</p>",
        "ggvFVWKzP1G_text": "<p>\"I hesitated at first because it’s an investment. But I realized I was spending more on studio memberships I couldn’t use and impulse buys trying to ‘feel better.’ This actually works. It’s beautiful, it’s calming, and I feel stronger and more in control again.\"</p>"
      },
      "type": "gp-section-571080519534576864"
    },
    "gp_section_571080519534642400": {
      "settings": {
        "checksum": "0c5636fd109fd78f4e361bb95a5d751aed40f0ffb84b955a395fb93dd1bd472d_1_1_1_0__1",
        "ggTeyYhZECO_label": "<p>CHECK AVAILABILITY</p>"
      },
      "type": "gp-section-571080519534642400"
    },
    "gp_section_571670903910302944": {
      "settings": {
        "checksum": "4e6493dd7e879431b1b5aa057d27cb9d8beada9547d0059dae772ebfa360326c_1_1_1_0__1",
        "ggnAXDAyPZh_text": "<p><span style=\"background-color:transparent;color:#000000;font-size:18px;\"><strong>P.S.</strong> Six months after getting my Elevé, Emma asked me why I don't wince anymore when she jumps into my arms. I told her it's because Mommy found a way to make her back strong again. She hugged me tighter and whispered, \"I'm so happy you're not broken anymore, Mommy.\"</span></p><p>&nbsp;</p><p><span style=\"background-color:transparent;color:#000000;font-size:18px;\">Neither am I, sweetheart. Neither am I.</span></p>"
      },
      "type": "gp-section-571670903910302944"
    }
  },
  "order": [
    "gp_section_571080519534511328",
    "gp_section_571670903910302944",
    "gp_section_571080519534576864",
    "gp_section_571080519534642400"
  ],
  "layout": "theme.gempages.blank"
}
